# Hướng dẫn cấu hình port channel 
- Port channel là kỹ thuật gộp 2 hay nhiều port làm 1 đường truyền logic nhằm tăng băng thông và đảm bảo khả năng dự phòng
- Đầu tiên bạn phải xác định xem bạn định sử dụng loại group port nào
  - LACP (Link Aggregation Control Protocol): Là giao thức giúp các hãng không đồng nhất kết hợp với nhau
  - PAgP (Port Aggregation Protocol):Là giao thức độc quyền của hãng cisco
  - on : Là cách bật portchannel là luôn bật
  ```
  switch(config)# feature lacp
  ```
- Hoặc cũng cần xác định xem các port tham gia portchannel xem thuộc layer mấy
  ```
  switch(config-if)# no switchport # lệnh này sử dụng nếu muốn dùng port ở layer 3 
  ```
- Hoặc cũng có thể xác định xem chế độ truyền là full duplex hay half duplex
  ```
  switch(config-if)# duplex auto
  ```
- Tiếp theo ta cần xác định xem port nào thuộc vào po để sử dụng
  ```
  switch(config)# int E1/3
  switch(config-if)# channel-group 1 mode active
  ```

  ![Alt](/thuctap/anh/Screenshot_867.png)
- Sau khi add port vào group bây giờ ta có thể xác một vài thuộc tính của po đó như đặt IP chẳng hạn. 
  ```
  switch(config)# int po1
  switch(config-if)# ip addr 192.168.11.100 255.255.255.0
  ```
`Lưu ý: khi chúng ta add port vào po thì đã xác định tính chất của port đó thuộc layer 2 hay 3 nên khi ta thao tác với po thì cũng cần phải làm những thứ phù hợp với layer 3`

Cấu hình chi tiết
- Trên switch 1
  ```
    switch(config)# feature lacp
    switch(config)# int E1/3
    switch(config-if)# no switchport
    switch(config-if)# duplex auto
    switch(config-if)# channel-group 1 mode active
    switch(config-if)# exit
    switch(config)# int E1/4
    switch(config-if)# no switchport
    switch(config-if)# duplex auto
    switch(config-if)# channel-group 1 mode active
    switch(config-if)# exit
    switch(config)# int po1
    switch(config-if)# ip addr 192.168.12.101 255.255.255.0
    switch(config-if)# copy running-config startup-config
  ```
- Trên switch 2
  ```
    switch(config)# feature lacp
    switch(config)# int E1/3
    switch(config-if)# no switchport
    switch(config-if)# duplex auto
    switch(config-if)# channel-group 1 mode active
    switch(config-if)# exit
    switch(config)# int E1/4
    switch(config-if)# no switchport
    switch(config-if)# duplex auto
    switch(config-if)# channel-group 1 mode active
    switch(config-if)# exit
    switch(config)# int po1
    switch(config-if)# ip addr 192.168.12.101 255.255.255.0
    switch(config-if)# copy running-config startup-config
  ```
Bây giờ ta có thể tiến hành kết nối các port và ping thử để kiểm tra bằng cách rút thử 1 trong 2 dây ra

![Alt](/thuctap/anh/Screenshot_866.png)


# Hướng dẫn reset lại mật khẩu password khi đã quên
- Mặc định khi switch NX OS reset lại cấu hình thì chỉ dùng tài khoản admin với password để trống nên khi đến phần nhập password ta chỉ cần nhấn `Enter`
- Để reset lại password đầu tiên ta cần phải tắt nguồn đi bật lại sau đó spam tổ hợp phím `ctrl + ]` hoặc `ctrl + C` 
- Tiếp theo ta thực hiện lần lượt các câu lệnh sau
  ```
  switch(boot)# conf t
  switch(boot)(config)# admin-password NewPassword
  switch(boot)(config)# exit
  switch(boot)# load bootflash: <system_image_file.bin> # lệnh này thực hiện nếu ta muốn load lại hệ điều hành
  ```
- Tiếp theo ta sẽ reload lại như quá trình bật máy lên bình thường
- Bây giờ ta đăng nhập và bằng tài khoản ta đã thay đổi và cập nhập lại câu hình và mật khẩu
  ```
  switch# conf t
  switch(config)# username admin password 0 New_PASSWORD
  switch(config)# copy running-config startup-config
  ```

# Một vài câu lệnh kiểm tra nên nhớ
- Xem cấu hình đang chạy
  ```
  switch1(config)# show running-config
  ```
- Ta có thể kết hợp với int để chỉ show ra cấu hình của interface
  ```
  switch1(config)# show running-config int
  ```
- Ta có thể show ra trạng thái của interface bằng lệnh
  ```
  switch1(config)# show interfaces brief
  ```
- Reset lại toàn bộ cấu hình về mặc định
  ```
  switch# write erase
  switch# reload
  ```
- Ta có thể reset lại cấu hình mặc định của interface
  ```
  switch1(config)# default interface ethernet1/3
  ```
- Ta cũng có thể thiết lập các quá trình đặt lại tên, loại layer, ip mngt,... băng lệnh
  ```
  switch1(config)# setg
  ```